#include "0000. Typedef.h"
/*********************************************************************************
  *函数： CreateHead
  *描述： 从后往前逆向建立单链表，每次将新元素插在"头指针后"
  *输入：	SLNode *head		待执行 "头插法" 建表的单链表头指针*head
		Elem x[]		存放待插入元素的数组x[]
		int n			数组中待插入元素的个数n
  *输出： 完成元素插入的单链表头指针*head
  *返回：	无
**********************************************************************************/
void CreateHead(SLNode *head, Elem x[], int n) {
	for (int i = 0; i < n; i++) {
		SLNode *temp = (SLNode*)malloc(sizeof(SLNode));	/* 建立存放数据的结点 */
		temp->Date = x[i];
		// 先将后一结点的地址信息存入新结点，防止丢失
		temp->next = head->next;			/* 新结点的尾放在 "第一个元素前" */ 
		head->next = temp;				/* 新结点的头放在 "头指针后" */ 
	}
}